[
  {
    "id": 0,
    "company": "Veldhuis Photography",
    "positionTitle": "Photographer",
    "start": 2018,
    "end": null,
    "location": "Edmonton, AB",
    "tasks": [
      "Planned and prepared for on-location photoshoots, communicated with clients about their wants, and shot and edited photographs in a manner to maintain the brand, and satisfy clients.",
      "Created, advertised, and maintained a brand while growing a client base."
    ],
    "isVolunteer": false,
    "techstack": ["Lightroom", "Photoshop"]
  },
  {
    "id": 1,
    "company": "Diversity in Engineering",
    "positionTitle": "VP Outreach and Promotions",
    "start": "Sept 2020",
    "end": "Apr 2022",
    "location": "Edmonton, AB",
    "tasks": [
      "Responsible for the promotion and recruitment of the group, developed and shared creative media content across social media platforms, and created a detailed and professional website.",
      "Organized, mentored, and supervised the social media team, set up regular tasks and activity for all social media outlets, and reported on social media activity regularly."
    ],
    "isVolunteer": true
  },
  {
    "id": 2,
    "company": "Engineering Students' Society",
    "positionTitle": "VP Communications",
    "start": "May 2023",
    "end": "Apr 2024",
    "location": "Edmonton, AB",
    "tasks": [
      "Elected to represent and advocate for nearly 5000 engineering students, while overseeing the five divisions of the Communications team.",
      "Managed a team of 20+ volunteers on multiple projects. Regularly delegated tasks and tracked work with the executive team and ESS volunteers and encouraged student participation in events through multiple media streams."
    ],
    "isVolunteer": true
  },
  {
    "id": 3,
    "company": "Western Management Consulting",
    "positionTitle": "Data Analyst",
    "start": "May 2020",
    "end": "Dec 2021",
    "location": "Edmonton, AB",
    "tasks": [
      "Utilized Power BI, PowerApps, and Microsoft Flow to model, design, manipulate, and visualize data.",
      "Developed a database-integrated phone app to enhance company data interactions and understanding."
    ],
    "isVolunteer": false,
    "associatedPrograms": ["PowerBI", "PowerApps", "Microsoft Flow"]
  },
  {
    "id": 4,
    "company": "Breathe BioMedical",
    "positionTitle": "Electrical Engineering Intern",
    "start": "May 2023",
    "end": "Dec 2023",
    "location": "Moncton, NB",
    "tasks": [
      "Engineered a temperature and pressure monitoring enclosure, integrating RS-485 and MODBUS protocols with LabVIEW for accurate data acquisition and control.",
      "Designed and constructed a Low-Drop-Off PCB for an ISO 13485 certified spectrometer using Altium Designer.",
      "Reduced redundancies by updating the spectrometer’s wiring diagram (with 54 interconnected schemas) and commending design improvements",
      "Independently automated and streamlined clinical sample tracking for over 90,000 samples, creating a consistent, normalized, and indexed database using Python, Dash, and MySQL."
    ],
    "associatedPrograms": [
      "Altium Designer",
      "Fusion360",
      "SolidWorks Electrical",
      "Python",
      "MySQL",
      "LabVIEW",
      "GitLab"
    ],
    "isVolunteer": false
  },
  {
    "id": 5,
    "company": "Tetra Tech",
    "positionTitle": "Engineer In Training",
    "start": "Sept 2024",
    "end": "Dec 2024",
    "secondStart": "Mar 2025",
    "secondEnd": null,
    "location": "Edmonton, AB",
    "tasks": [
      "Utilized advanced data collection equipment and techniques, including LiDAR and LCMS (Laser Crack Measurement System) to ensure high-quality data acquisition for various roadway projects.",
      "Developed a Python script for data quality assurance, validating Lidar-detected overhead lines against historical records to ensure accuracy."
    ],
    "associatedPrograms": ["Python"],
    "isVolunteer": false
  },
  {
    "id": 6,
    "company": "HK Technologies",
    "positionTitle": "Embedded Software Engineer",
    "start": "Mar 2025",
    "end": null,
    "location": "Edmonton, AB",
    "tasks": [
      "Designed, developed, and tested embedded firmware for six ESP32-based controllers in a smart HVAC system, enabling heating and cooling control via I2C, MODBUS, and PWM protocols.",
      "Led the development of a large-scale Flutter application using BLoC architecture and Cloud Firestore integration to monitor and update HVAC controller data (temperature, status, settings) in real time.",
      "Designed, routed, and tested a high-power, 4-layer PCB featuring 24VAC, I2C, and MODBUS inputs, integrated touchscreen, multiple 110VAC relays, and a 10V PWM output; designed using EasyEDA. ",
      "Developed a Wi-Fi mesh network to enable efficient device communication, improving scalability and reliability of smart HVAC systems."
    ],
    "associatedPrograms": [
      "C++",
      "Embedded Systems",
      "PlatformIO",
      "GitHub",
      "RTOS",
      "BLE"
    ],
    "isVolunteer": false
  }
]
